# name = 'goa'

# if name == 'goa':
#     print(True)

# ნაშთები, remainders

# 8 / 2 = 4
# 10 / 5 = 2

# 10 / 6 = 1 (ნ 4)
# 8 / 3 = 2 (ნ 2)
# 7 / 5 = 1 (ნ 2)
# 12 / 7 = 1 (ნ 5)

# 16 / 9 = 1 (ნ 7)
# 21 / 6 = 3 (ნ 3)




# ლუწი (even), კენტი (odd)

# ლუწი - 2, 4, 6, 8, 10, 12, 14, 16, 18, 20
# კენტი - 1, 3, 5, 7, 9, 11, 13, 15, 17, 19

# ლუწი არის რიცხვი, რომელიც იყოფა 2-ზე და გაყოფისას ნაშთს ტოვებს 0-ს.

# კენტი არის რიცხვი, რომელიც 2-ზე გაყოფისას ნაშთს ტოვებს 1-ს.


# num = 11

# # თუ რიცხვის 2-ზე გაყოფისას, ნაშთი არის 0
# if num %2 == 0:
#     print('Even')
# else:
#     print('Odd')

def evenOdd(num):
    if num %2 == 0:
        return 'Even'
    else:
        return 'Odd'
    

user_input = int(input('Enter a number: '))
print(evenOdd(user_input))









# num = 41

# print(num %5)

# num-ის, %-ის შემდეგ დაწერილი რიცხვზე გაყოფისას 
# მიღებული ნაშთი


