# # 10. ცვლადში მომხარებელს ინფუთით შემოატანინე მისი ასაკი, 
# # და დაუპრინტე თუ რომელი წელი იყო მისი დაბადების დროს.

# user_age = int(input())
# print(2024 - user_age)


# # 11. ცვლადში მომხმარებელს ინფუთით შემოატანინე მისი ასაკი, 
# # მეორე ცვლადში კი მამამისის ასაკი, საბოლოოდ დაუპრინტე, თუ 
# # რამდენჯერ დიდია მამამისი მასზე.
# user_age = int(input())
# father_age = int(input())


# print(father_age/user_age)



# # 11. ცვლადში მომხმარებელს ინფუთით შემოატანინე მისი ასაკი, 
# # მეორე ცვლადში კი მამამისის ასაკი, საბოლოოდ დაუპრინტე, თუ 
# # რამდენჯერ დიდი იქნება მამამისი მასზე 15 წლის შემდეგ.

# user_age = int(input())
# father_age = int(input())

# print((father_age + 15)/(user_age + 15))
