// let greeting = document.getElementById('greet')

// greeting.style.color = 'red'

// console.log(greeting)

// let name = 'giorgi' 

// let name = 'sandro'
// console.log(name)

// let name = 'giorgi'
// name = 'saba'
// console.log(name)

// const brand = 'bmw'
// brand = 'new'
// console.log(bra)


// let age = 15
// let age = 13


const person = {
    name: 'saba',
    lastname: 'surmanidze',
    age: 13
}

let y = person.lastname


let x = person['name']

console.log(x, y)


// let x = person.lastname
// console.log(x)
// let x = person.name
// console.log(x)
// console.log(person.name)
// let x = person.age
// console.log(x)
// console.log(person.age)



// const things = {
//     color: 'red',
//     height: 183,
//     weight: 50
// }


const hair = {
    color: 'blue',
    isstudent: true
}

const car = {
    makeYear: 2000
}

if (car.makeYear > 2000) {
    console.log('pass')
}

აქ მოცემულია 5 სავარჯიშო იმავე ფორმატითა და სირთულით, რომლებიც ფოკუსირებულია JavaScript ობიექტებზე, თვისებებსა და ძირითად პირობით პირობებზე:

---

**1.** შექმენით ობიექტი სახელწოდებით `წიგნი` მინიმუმ ხუთი თვისებით, როგორიცაა `სათაური`, `ავტორი`, `გვერდები`, `ჟანრი` და `არის ხელმისაწვდომი`.
ობიექტის შექმნის შემდეგ, დაბეჭდეთ თითოეული თვისების ღირებულება კონსოლში.

-- -

**2.** შექმენით ობიექტი სახელად `სტუდენტი` ისეთი თვისებებით, როგორიცაა `სახელი`, `კლასი`, `გავლილი` და `წელი`.
შემდეგ გამოიყენეთ `if-else' განცხადება, რათა შეამოწმოთ, არის თუ არა `გადავლილი~ `true'. თუ ასეა, დაბეჭდეთ ``სტუდენტი წარმატებით გაიარა''; წინააღმდეგ შემთხვევაში, დაბეჭდეთ ``სტუდენტი წარუმატებელი იყო~.

---

**3.** შექმენით ობიექტი სახელწოდებით `movie` ისეთი თვისებებით, როგორიცაა `სათაური`, `რეიტინგი`, `ხანგრძლივობა`, `გამოშვების წელი~ და `isAnimated`.
შემდეგ კონსოლზე დაბეჭდეთ წინადადება შემდეგი მნიშვნელობების გამოყენებით, მაგალითად: „ფილმი [სათაური] შეფასებულია [რეიტინგი] და გამოვიდა [წელიწადში].“

---

**4.** შექმენით ობიექტი სახელწოდებით `ტელეფონი` `ბრენდი`, `მოდელი`, `შენობა`, `ბატერიისცხოვრება` და `is5G` თვისებებით.
გამოიყენეთ `if` ოპერატორი, რათა შეამოწმოთ, აქვს თუ არა ტელეფონს `is5G` დაყენებული `true`-ზე. თუ ასეა, დაბეჭდეთ ``მხარს უჭერს 5G-ს'', წინააღმდეგ შემთხვევაში დაბეჭდეთ ``არ უჭერს მხარს 5G-ს''.

---

**5.** შექმენით ობიექტი სახელწოდებით `თამაში` თვისებებით `name`, `players`, `online`, `releaseYear` და `ჟანრი`.
შემდეგ გამოიყენეთ `if-else` განაცხადი, რათა შეამოწმოთ, არის თუ არა `მოთამაშეები` 1-ზე მეტი. თუ ასეა, დაბეჭდეთ ``Multiplayer game'', სხვა შემთხვევაში დაბეჭდეთ ``Single player game''.

---

შემატყობინეთ, თუ გსურთ "ბონუს" ვერსია ან ამოცანები ჩადგმული ობიექტებით ან მასივებით.