# # მინდა რომ დავამატო ახალ სიაში,
# # გაორმაგებული რიცხვები ⬇️

# # ძველი სია
# old_list = [1, 2, 3, 4, 5]

# # ახალი სია
# new_list = []

# # for loop, რომელიც დატრიალდება 5-ჯერ
# for i in old_list:
#     new_list.append(i*2)

# print(new_list) # შედეგი - [2, 4, 6, 8, 10]



list = [1, 2, 3]

new_list = []


for i in list:
    new_list.append(i**2)


print(new_list)











    







# new_list = [2]

# new_list.append(5)

# print(new_list)









# revising append

# list = [1, 2]

# list.append(3)

# print(list)








# # range(5) -> 0, 1, 2, 3, 4

# i = 0
# i = 1
# i = 2
# i = 3
# i = 4

# for i in range(5):
#     print(i)


# გუნდი 1- დავით დევაძე
# 1. ფილიპე ბურჭულაძე
# 2. სანან მამედოვი
# 3. დემეტრე ყოჩაშვილი

# გუნდი 2 - თორნიკე ღორაშვილი
# 1. ალექსანდრე სამუშია
# 2. გაბრიელ რობაქიძე
# 3. ნიკოლოზ ბატურინი


# გუნდი 3 - მარიამ გელაშვილი
# 1. მარიამ ჩაიძე
# 2. ანასტასია ნათელაური 
# 3. ნინო ღვინიაშვილი

# გუნდი 4 - გიორგი გაგოშიძე
# 1. საბა ღლიღვაშვილი
# 2. ლაზარე კუკავა
# 3. საბა სურმანიძე

# გუნდი 5- ნიკოლოზ გირგვლიანი
# 1. გიორგი ურიდია
# 2. მიკა მესხიშვილი
# 3. ბენი ხუხაშვილი



# არ შესულან 

# დემეტრე ყოჩიაშვილი
# ნიკოლოზ ბატურინი
# ბენი ხუხაშვილი


